#!/usr/bin/env bash

read -r -p "Какой общий объем диска в Гб? " a
read -r -p "Какой объем занятого пространства? " b

per=$((a - b)) 

if [[ $a -le 0 ]]; then
    printf "Некорректные значения диска\n"
elif [[ $b -gt $a ]]; then
    printf "Некорректное значение, занятое пространство не может быть больше общего объема!\n"
elif [[ $b -lt 0 ]]; then
    printf "Некорректное значение, занятое пространство не может быть отрицательным числом! %s\n" "$b"
elif percent=$((b *100 /a))&& [[ $percent -ge 90 ]]; then
    printf "CRITICAL Занято слишком много места: %d%%\n" "$percent"
    printf "Свободное пространство Гб: %s\n" "$per"
else
    printf "Свободное пространство Гб: %s\n" "$per" 
    printf "OK Занятого места достаточно: %d%%\n" "$percent"
fi